STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_p2pServerThreadX/STM32_WPAN/App/app_ble.c
uint64_t buffer_nvm[CFG_BLEPLAT_NVM_MAX_SIZE] = {0};

static AMM_VirtualMemoryCallbackFunction_t APP_BLE_ResumeFlowProcessCb;

/**
 * Host stack init variables
 */
static uint32_t buffer[DIVC(BLE_DYN_ALLOC_SIZE,4)];
static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE,4)];
static BleStack_init_t pInitParams;

/* BLE_HOST_TASK related resources */
TX_THREAD BLE_HOST_Thread;

/* HCI_ASYNCH_EVT_TASK related resources */
TX_THREAD HCI_ASYNCH_EVT_Thread;
TX_SEMAPHORE HCI_ASYNCH_EVT_Thread_Sem;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* BLE_HOST_TASK related resources */
TX_SEMAPHORE BLE_HOST_Thread_Sem;

/* PROC_GAP_COMPLETE related resources */
TX_SEMAPHORE PROC_GAP_COMPLETE_Sem;

/* USER CODE BEGIN GV */
TX_THREAD ADV_CANCEL_Thread;
TX_SEMAPHORE ADV_CANCEL_Thread_Sem;
/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static void BleStack_Process_BG(void);
static void Ble_UserEvtRx(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
static void BLE_ResumeFlowProcessCallback(void);
static void BLE_NvmCallback (SNVMA_Callback_Status_t);
static uint8_t  HOST_BLE_Init(void);
static void Ble_UserEvtRx_Entry(unsigned long thread_input);
static void BleStack_Process_BG_Entry(unsigned long thread_input);
/* USER CODE BEGIN PFP */
static void Adv_Cancel_Req(void *arg);
static void Adv_Cancel(void);
static void Switch_OFF_GPIO(void *arg);
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t*p_bd_addr);
static void Adv_Cancel_Entry(unsigned long thread_input);
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  CHAR * pStack;

  if (tx_byte_allocate(pBytePool, (void **) &pStack, BLE_HOST_TASK_STACK_SIZE,TX_NO_WAIT) != TX_SUCCESS)
  {
    Error_Handler();
  }
  if (tx_semaphore_create(&BLE_HOST_Thread_Sem, "BLE_HOST_Thread_Sem", 0) != TX_SUCCESS )
  {
    Error_Handler();
  }
  if (tx_thread_create(&BLE_HOST_Thread, "BLE_HOST_Thread", BleStack_Process_BG_Entry, 0,
                         pStack, BLE_HOST_TASK_STACK_SIZE,
                         BLE_HOST_TASK_PRIO, BLE_HOST_TASK_PREEM_TRES,
                         TX_NO_TIME_SLICE, TX_AUTO_START) != TX_SUCCESS)
  {
    Error_Handler();
  }

  if (tx_byte_allocate(pBytePool, (void **) &pStack, HCI_ASYNCH_EVT_TASK_STACK_SIZE,TX_NO_WAIT) != TX_SUCCESS)
  {
    Error_Handler();
  }
  if (tx_semaphore_create(&HCI_ASYNCH_EVT_Thread_Sem, "HCI_ASYNCH_EVT_Thread_Sem", 0) != TX_SUCCESS )
  {
    Error_Handler();
  }
  if (tx_thread_create(&HCI_ASYNCH_EVT_Thread, "HCI_ASYNCH_EVT_Thread", Ble_UserEvtRx_Entry, 0,
                         pStack, HCI_ASYNCH_EVT_TASK_STACK_SIZE,
                         HCI_ASYNCH_EVT_TASK_PRIO, HCI_ASYNCH_EVT_TASK_PREEM_TRES,
                         TX_NO_TIME_SLICE, TX_AUTO_START) != TX_SUCCESS)
  {
    Error_Handler();
  }

  /* NVM emulation in RAM initialization */
  NVM_Init(buffer_nvm, 0, CFG_BLEPLAT_NVM_MAX_SIZE);

  /* First register the APP BLE buffer */
  SNVMA_Register (APP_BLE_NvmBuffer,
                  (uint32_t *)buffer_nvm,
                  (CFG_BLEPLAT_NVM_MAX_SIZE * 2));

  /* Realize a restore */
  SNVMA_Restore (APP_BLE_NvmBuffer);

  /* USER CODE BEGIN APP_BLE_Init_Buffers */

  /* USER CODE END APP_BLE_Init_Buffers */

  /* Check consistency */
  if (NVM_Get (NVM_FIRST, 0xFF, 0, 0, 0) != NVM_EOF)
  {
    NVM_Discard (NVM_ALL);
  }

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /**
     * Initialization of HCI & GATT & GAP layer
     */
    Ble_Hci_Gap_Gatt_Init();

    /**
     * Initialization of the BLE Services
     */
    SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    bleAppContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

    /* From here, all initialization are BLE application specific */

    /* USER CODE BEGIN APP_BLE_Init_4 */
  if (tx_byte_allocate(pBytePool, (void **) &pStack, ADV_CANCEL_TASK_STACK_SIZE,TX_NO_WAIT) != TX_SUCCESS)
  {
    Error_Handler();
  }
  if (tx_semaphore_create(&ADV_CANCEL_Thread_Sem, "ADV_CANCEL_Thread_Sem", 0)!= TX_SUCCESS )
  {
    Error_Handler();
  }
  if (tx_thread_create(&ADV_CANCEL_Thread, "ADV_CANCEL_Thread", Adv_Cancel_Entry, 0,
                         pStack, BLE_HOST_TASK_STACK_SIZE,
                         ADV_CANCEL_TASK_PRIO, ADV_CANCEL_TASK_PREEM_TRES,
                         TX_NO_TIME_SLICE, TX_AUTO_START) != TX_SUCCESS)
  {
    Error_Handler();
  }
    
    /* Create timer to handle the Advertising Stop */
    UTIL_TIMER_Create(&(bleAppContext.Advertising_mgr_timer_Id),
                      0,
                      (UTIL_TIMER_Mode_t)hw_ts_SingleShot,
                      &Adv_Cancel_Req,
                      0);
    /* Create timer to handle the Led Switch OFF */
    UTIL_TIMER_Create(&(bleAppContext.SwitchOffGPIO_timer_Id),
                      0,
                      (UTIL_TIMER_Mode_t)hw_ts_SingleShot,
                      &Switch_OFF_GPIO,
                      0);
    /* USER CODE END APP_BLE_Init_4 */

  /**
   * Initialize Services and Characteristics.
   */
    APP_DBG_MSG("\n");
    APP_DBG_MSG("Services and Characteristics creation\n");
    P2P_SERVER_APP_Init();
    APP_DBG_MSG("End of Services and Characteristics creation\n");
    APP_DBG_MSG("\n");

    /* USER CODE BEGIN APP_BLE_Init_3 */
    ret = aci_hal_set_radio_activity_mask(0x0006);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%2X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
    }

    /* Start to Advertise to accept a connection */
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);

    /* Start a timer to stop advertising after a while */
    UTIL_TIMER_StartWithPeriod(&bleAppContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);

    /* USER CODE END APP_BLE_Init_3 */

